{
    "projets": {
        "astar": {
            "title": "ASTAR Game",
            "date": "(mai. 2023 - aujourd’hui)",
            "technologies": [
                "PHP",
                "JavaScript",
                "HTML",
                "CSS",
                "MySQL",
                "Tailwind CSS",
                "Laravel",
                "Midjourney"
            ],
            "text": "ASTAR est un jeu de rôle en ligne palpitant, qui vous plonge dans un univers fantastique rempli de monstres à collectionner et à entraîner. Dans ce monde, vous commencerez votre aventure en invoquant des monstres avec des GemStars et vous les ferez évoluer au fil des combats et des donjons pour devenir de véritables bêtes de combat.Vous devrez affronter des champions et des boss redoutables pour passer d'une ville à l'autre, et débloquer de nouveaux monstres, de nouveaux donjons et des défis encore plus difficiles. Chaque monstre a ses propres aptitudes et statistiques, ce qui vous permettra de créer des équipes uniques et de développer des stratégies de combat uniques.En plus de collectionner des monstres, vous devrez également gérer votre Endurance et vos Jetons d’évolution pour progresser efficacement dans le jeu. Les événements et les quêtes vous permettront de gagner des récompenses uniques et rares, tandis que les boutiques spéciales vous proposeront des articles exclusifs pour améliorer vos monstres et faciliter votre progression.",
            "competence": [
                {
                    "id": 14,
                    "title": "Développement Web",
                    "icon": "fa-solid fa-code"
                },
                {
                    "id": 6,
                    "title": "Curiosité",
                    "icon": "fa-solid fa-search"
                },
                {
                    "id": 5,
                    "title": "Autonomie",
                    "icon": "fa-solid fa-user-check"
                },
                {
                    "id": 17,
                    "title": "Gestion de projet",
                    "icon": "fa-solid fa-people-group"
                },
                {
                    "id": 16,
                    "title": "Gestion de base de données"
                }
            ],
            "image": "ASTAR3.png"
        },
        "pokexpert": {
            "title": "Pokexpert",
            "date": "(sept. 2020 - sept. 2021)",
            "technologies": [
                "PHP",
                "JavaScript",
                "HTML",
                "CSS",
                "MySQL",
                "Bootstrap",
                "Laravel"
            ],
            "text": "Je suis heureux de vous présenter PokExpert, un projet que j'ai développé en solo et de manière autodidacte. PokExpert est un site web conçu spécialement pour les joueurs de Pokémon. Il offre un outil de gestion de listes permettant aux utilisateurs de suivre leur progression dans le jeu de manière simple et efficace.Sur PokExpert, chaque utilisateur peut créer des listes personnalisées de Pokémon. Ils peuvent ajouter ou supprimer des Pokémon de leurs listes pour refléter leur progression dans le jeu. De plus, ces listes peuvent être partagées avec la communauté, permettant à chacun de comparer ses progrès et d'échanger des astuces.À mesure qu'un utilisateur avance dans sa complétion, il peut cocher et marquer les Pokémon capturés ou obtenus. Une page de statistiques dédiée permet de visualiser la progression de ses listes individuelles ainsi que son avancement global. Cette fonctionnalité offre un aperçu clair et motivant de ses réalisations dans le jeu.PokExpert est un outil pratique et convivial pour tous les passionnés de Pokémon souhaitant organiser et partager leur expérience de jeu.",
            "competence": [
                {
                    "id": 14,
                    "title": "Développement Web",
                    "text": "Travailler sur des projets de développement web m'a permis de renforcer mes compétences en conception d'interfaces utilisateur conviviales et réactives. J'ai appris à concevoir des applications web modernes en utilisant les dernières technologies front-end et back-end pour offrir une expérience utilisateur optimale.",
                    "icon": "fa-solid fa-code"
                },
                {
                    "id": 6,
                    "title": "Curiosité",
                    "text": "Travailler sur des projets variés m'a permis de développer ma curiosité et ma soif d'apprendre. J'ai appris à explorer de nouvelles technologies, à relever de nouveaux défis et à rester constamment à jour sur les dernières tendances du secteur pour améliorer mes compétences et rester compétitif.",
                    "icon": "fa-solid fa-search"
                },
                {
                    "id": 5,
                    "title": "Autonomie",
                    "text": "J'ai également développé mes compétences en autonomie en travaillant sur ces projets. J'ai appris à prendre des initiatives, à résoudre les problèmes de manière indépendante et à être proactif dans mon apprentissage.",
                    "icon": "fa-solid fa-user-check"
                },
                {
                    "id": 16,
                    "title": "Gestion de base de données"
                }
            ],
            "image": "PokE1.png"
        },
        "requin":{
            "title": "Requin",
            "date": "(2023-2024)",
            "technologies": [
                "Pyhton"
            ],
            "text":"Dans le cadre de mon travail, j'ai entrepris un projet en solo visant à améliorer l'efficacité et la productivité de notre équipe. Pour ce faire, j'ai développé une série de scripts automatisant diverses tâches répétitives et chronophages, que j'ai intégrés dans un programme unique en Python, accessible à tous.Ce programme regroupe plusieurs scripts aux fonctionnalités variées. Par exemple, certains scripts permettent de découper des fichiers volumineux en segments plus petits, facilitant ainsi leur gestion et leur analyse. D'autres scripts comparent des données entre plusieurs fichiers pour trier et organiser l'information de manière optimale.De plus, j'ai inclus des scripts qui automatisent une série d'actions nécessaires avant le lancement d'un serveur local, simplifiant et accélérant ainsi le processus de mise en route de nos environnements de développement.Grâce à ce programme, notre équipe peut désormais accomplir ces tâches complexes en quelques clics, libérant du temps pour se concentrer sur des activités à plus forte valeur ajoutée. ",
            "competence": [
                {
                    "id": 4,
                    "title": "Automatisation avec Python",
                    "icon": "fa-brands fa-python"
                },
                {
                    "id": 6,
                    "title": "Curiosité",
                    "icon": "fa-solid fa-search"
                },
                {
                    "id": 5,
                    "title": "Autonomie",
                    "icon": "fa-solid fa-user-check"
                }
            ],
            "image": "image.png"
        }
    },
    "experiences": {
        "lei": {
            "type": "Stage",
            "title": "Développeur Web chez LEI",
            "date": "(fév. 2020 - avr. 2020)",
            "technologies": [
                "ASP.NET",
                "Angular 5",
                "C#",
                "RESTful API"
            ],
            "text": "En tant que développeur web chez LEI, j'ai eu l'opportunité de plonger directement dans le monde du développement web, même sans une connaissance préalable approfondie de ASP.NET et Angular 5, en travaillant sur un projet crucial de migration de fonctionnalités. Mon principal objectif était de migrer une fonctionnalité existante de ASP.NET vers une architecture plus moderne, utilisant ASP.NET REST et Angular 5. Cette tâche impliquait une compréhension approfondie des deux technologies, ainsi que des compétences en gestion de projet pour respecter les délais impartis.",
            "competences": [
                {
                    "id": 14,
                    "title": "Développement Web",
                    "text": "Travailler sur des projets de développement web m'a permis de renforcer mes compétences en conception d'interfaces utilisateur conviviales et réactives. J'ai appris à concevoir des applications web modernes en utilisant les dernières technologies front-end et back-end pour offrir une expérience utilisateur optimale.",
                    "icon": "fa-solid fa-code"
                },
                {
                    "id": 7,
                    "title": "Découverte d'Angular 5",
                    "text": "La migration vers Angular 5 a été une véritable révélation pour moi. Sans expérience préalable avec Angular, j'ai plongé dans cet écosystème passionnant et j'ai appris à concevoir des interfaces utilisateur dynamiques et réactives en utilisant les concepts modernes du développement frontend.",
                    "icon": "fa-brands fa-angular"
                },
                {
                    "id": 2,
                    "title": "Apprentissage de ASP.NET",
                    "text": "Bien que je n'aie pas eu d'expérience antérieure avec ASP.NET, j'ai rapidement appris ses concepts fondamentaux et ses meilleures pratiques tout en travaillant sur la migration. Cette expérience m'a permis de comprendre les tenants et les aboutissants du développement backend et de développer mes compétences en C#.",
                    "icon": "fa-solid fa-code"
                },
                {
                    "id": 9,
                    "title": "Développement C#.NET",
                    "text": "Travailler sur des projets C#.NET m'a permis de renforcer mes compétences en développement backend. J'ai appris à concevoir des applications robustes et évolutives en utilisant les meilleures pratiques de développement C# et en respectant les normes de qualité élevées.",
                    "icon": "fa-solid fa-code"
                },
                {
                    "id": 3,
                    "title": "Architecture RESTful",
                    "text": "Cette expérience m'a permis de comprendre les principes fondamentaux de l'architecture REST et de les mettre en pratique. J'ai appris à concevoir des API REST efficaces et évolutives, favorisant une communication efficace entre le frontend et le backend.",
                    "icon": "fa-solid fa-code"
                },
                {
                    "id": 17,
                    "title": "Gestion de projet",
                    "text": "Travailler sur ces projets m'a également donné une expérience précieuse en gestion de projet. J'ai appris à prioriser les tâches, à respecter les échéances et à collaborer efficacement avec les membres de l'équipe pour atteindre nos objectifs communs.",
                    "icon": "fa-solid fa-people-group"
                },
                {
                    "id": 8,
                    "title": "Développement agile",
                    "text": "Ces expériences m'ont également initié aux méthodologies de développement agile. J'ai appris à travailler de manière itérative, à m'adapter aux changements et à collaborer étroitement avec les membres de l'équipe pour résoudre les problèmes rapidement.",
                    "icon": "fa-solid fa-tasks"
                }
            ],
            "competencesFonctionelle": [
                {
                    "id": 25,
                    "title": "Travail en équipe",
                    "text": "Travailler à plusieur m'a permis de développer mes compétences en travail d'équipe. J'ai appris à collaborer efficacement avec les membres de l'équipe, à partager mes connaissances et à résoudre les problèmes ensemble.",
                    "icon": "fa-solid fa-people-carry-box"
                },
                {
                    "id": 19,
                    "title": "Gestion du temps",
                    "text": "La gestion du temps était un aspect crucial de ce projet. J'ai appris à prioriser les tâches, à respecter les échéances et à m'adapter aux changements pour atteindre nos objectifs dans les délais impartis.",
                    "icon": "fa-solid fa-clock"
                },
                {
                    "id": 1,
                    "title": "Adaptabilité",
                    "text": "Travailler sur ces projets m'a également appris à être adaptable et à m'adapter rapidement aux nouvelles technologies et aux nouveaux défis. J'ai appris à sortir de ma zone de confort et à relever des défis techniques avec confiance.",
                    "icon": "fa-solid fa-briefcase"
                },
                {
                    "id": 5,
                    "title": "Autonomie",
                    "text": "J'ai également développé mes compétences en autonomie en travaillant sur ces projets. J'ai appris à prendre des initiatives, à résoudre les problèmes de manière indépendante et à être proactif dans mon apprentissage.",
                    "icon": "fa-solid fa-user-check"
                }
            ],
            "conclusion": "Cette expérience chez LEI a été un véritable tremplin pour moi dans le monde du développement web, me permettant d'acquérir rapidement de nouvelles compétences techniques tout en développant une compréhension approfondie des technologies modernes. Elle a renforcé ma conviction que l'apprentissage continu et l'adaptabilité sont essentiels pour réussir dans ce domaine en constante évolution. Elle a également renforcé ma passion pour le développement web et ma capacité à m'adapter à de nouveaux défis technologiques."
        },
        "octafood": {
            "type": "Alternance",
            "title": "Développeur C#.NET / DELPHI",
            "date": "(sept. 2020 - oct. 2021)",
            "technologies": [
                "C#",
                "Delphi",
                "SQL Server",
                ".NET Framework"
            ],
            "text": "Chez OCTAFOOD, une entreprise spécialisée dans le développement de logiciels destinés au secteur de l'agroalimentaire, j'ai eu le privilège de travailler en tant que développeur C#.NET et Delphi. Mon rôle principal consistait à assurer la maintenance et l'amélioration des logiciels existants, en répondant aux tickets de correction, en assurant l'installation chez les clients et en mettant en place de nouvelles fonctionnalités pour répondre aux besoins évolutifs de l'entreprise.",
            "competences": [
                {
                    "id": 9,
                    "title": "Développement C#.NET",
                    "text": "Travailler sur des projets C#.NET m'a permis de renforcer mes compétences en développement backend. J'ai appris à concevoir des applications robustes et évolutives en utilisant les meilleures pratiques de développement C# et en respectant les normes de qualité élevées.",
                    "icon": "fa-solid fa-code"
                },
                {
                    "id": 10,
                    "title": "Développement Delphi",
                    "text": "Travailler avec Delphi a été une expérience unique pour moi. J'ai appris à concevoir des applications Windows puissantes et conviviales en utilisant les fonctionnalités avancées de Delphi et en respectant les exigences spécifiques du secteur de l'agroalimentaire.",
                    "icon": "fa-solid fa-code"
                },
                {
                    "id": 16,
                    "title": "Gestion de base de données",
                    "text": "Pour gerer les données collectées, j'ai développé mes compétences en gestion de base de données. J'ai appris à concevoir des schémas de base de données efficaces, à optimiser les requêtes SQL et à assurer la sécurité des données pour garantir la fiabilité et la performance des applications.",
                    "icon": "fa-solid fa-database"
                },
                {
                    "id": 20,
                    "title": "Installation chez les clients",
                    "text": "L'installation des logiciels chez les clients m'a permis de comprendre l'importance de l'interopérabilité et de la compatibilité logicielle. J'ai acquis une expérience pratique dans la configuration et le déploiement de solutions logicielles sur différentes infrastructures, en veillant à ce que les installations se déroulent sans heurts et que les clients soient pleinement satisfaits de nos services.",
                    "icon": "fa-solid fa-server"
                },
                {
                    "id": 18,
                    "title": "Gestion des tickets de correction",
                    "text": "En traitant les tickets de correction, j'ai développé des compétences solides en analyse et en débogage de code. J'ai appris à diagnostiquer rapidement les problèmes, à élaborer des solutions efficaces et à les mettre en œuvre de manière précise pour assurer la stabilité et la fiabilité des applications.",
                    "icon": "fa-solid fa-bug"
                },
                {
                    "id": 11,
                    "title": "Développement de nouvelles fonctionnalités",
                    "text": "La mise en place de nouvelles fonctionnalités m'a offert l'occasion d'innover et de repousser les limites des logiciels existants. J'ai appris à recueillir les exigences des clients, à concevoir des solutions techniques adaptées et à les mettre en œuvre de manière efficace, en veillant à ce qu'elles soient conviviales et répondent aux besoins métier spécifiques.",
                    "icon": "fa-solid fa-lightbulb"
                }
            ],
            "competencesFonctionelle": [
                {
                    "id": 23,
                    "title": "Relation Client",
                    "text": "En travaillant pour les demandes des clients, j'ai développé mes compétences en relation client. J'ai appris à écouter attentivement les besoins des clients, à communiquer efficacement avec eux et à fournir des solutions adaptées pour répondre à leurs attentes.",
                    "icon": "fa-solid fa-headset"
                },
                {
                    "id": 6,
                    "title": "Curiosité",
                    "text": "Travailler sur des projets variés m'a permis de développer ma curiosité et ma soif d'apprendre. J'ai appris à explorer de nouvelles technologies, à relever de nouveaux défis et à rester constamment à jour sur les dernières tendances du secteur pour améliorer mes compétences et rester compétitif.",
                    "icon": "fa-solid fa-search"
                },
                {
                    "id": 25,
                    "title": "Travail en équipe",
                    "text": "Travailler à plusieur m'a permis de développer mes compétences en travail d'équipe. J'ai appris à collaborer efficacement avec les membres de l'équipe, à partager mes connaissances et à résoudre les problèmes ensemble.",
                    "icon": "fa-solid fa-people-carry-box"
                },
                {
                    "id": 5,
                    "title": "Autonomie",
                    "text": "J'ai également développé mes compétences en autonomie en travaillant sur ces projets. J'ai appris à prendre des initiatives, à résoudre les problèmes de manière indépendante et à être proactif dans mon apprentissage.",
                    "icon": "fa-solid fa-user-check"
                }
            ],
            "conclusion": "Mon expérience chez OCTAFOOD m'a permis de développer une solide expertise en développement logiciel, en mettant l'accent sur la qualité, la fiabilité et la satisfaction client. Elle m'a également enseigné l'importance de l'adaptabilité et de la polyvalence dans un environnement professionnel dynamique et en constante évolution."
        },
        "requea": {
            "type": "Alternance",
            "title": "Développeur logicel Web",
            "date": "(janv. 2023 - aujourd’hui)",
            "technologies": [
                "JavaScript",
                "Java",
                "Python",
                "Html",
                "CSS",
                "SQl",
                "MangoDB"
            ],
            "text": "Chez REQUEA, un éditeur de logiciels français spécialisé dans les plateformes de Cœur de Réseaux, j'ai eu le privilège de travailler en tant que développeur logiciel web dans le domaine de l'IoT. Notre entreprise œuvre depuis une décennie à fournir des solutions IoT intuitives aux collectivités, aux entreprises, aux gestionnaires de bâtiments et aux régies d’eau, en s'appuyant notamment sur le réseau LoRaWAN. Dans le cadre de mes fonctions, je suis responsable de la création et de l'intégration de nouvelles fonctionnalités demandées par nos clients pour notre plateforme. Ces développements sont principalement réalisés en Java pour le backend, garantissant ainsi des performances robustes et une scalabilité adaptée à nos besoins. Pour le frontend, j'utilise JavaScript afin d'offrir une interface utilisateur réactive et intuitive. En plus de ces tâches, je développe également des scripts Python pour simplifier certaines opérations. Python est particulièrement utile pour automatiser des processus répétitifs et complexes, ce qui permet de gagner du temps et de réduire les risques d'erreurs humaines. Mon travail inclut également le développement et l'analyse de scripts pour l'Internet des Objets (IoT). Étant donné que nous traitons régulièrement des données provenant de divers capteurs (eau, électricité, etc.), il est crucial de comprendre et d'analyser les trames de données reçues. Pour ce faire, j'écris des scripts en Python qui permettent de décoder ces trames, d'extraire les informations pertinentes et de les analyser. Ces scripts aident à monitorer les capteurs, détecter des anomalies et générer des rapports précis pour nos clients.",
            "competences": [
                {
                    "id": 14,
                    "title": "Développement Web",
                    "text": "Travailler sur des projets de développement web m'a permis de renforcer mes compétences en conception d'interfaces utilisateur conviviales et réactives. J'ai appris à concevoir des applications web modernes en utilisant les dernières technologies front-end et back-end pour offrir une expérience utilisateur optimale.",
                    "icon": "fa-solid fa-code"
                },
                {
                    "id": 12,
                    "title": "Développement IoT",
                    "text": "Travailler dans le domaine de l'IoT m'a permis de découvrir un nouvel univers technologique passionnant. J'ai appris à concevoir des solutions IoT innovantes en utilisant des capteurs, des réseaux sans fil et des plateformes cloud pour collecter, analyser et visualiser des données en temps réel.",
                    "icon": "fa-solid fa-network-wired"
                },
                {
                    "id": 16,
                    "title": "Gestion de base de données",
                    "text": "Pour gerer les données collectées, j'ai développé mes compétences en gestion de base de données. J'ai appris à concevoir des schémas de base de données efficaces, à optimiser les requêtes SQL et à assurer la sécurité des données pour garantir la fiabilité et la performance des applications.",
                    "icon": "fa-solid fa-database"
                },
                {
                    "id": 13,
                    "title": "Développement Java",
                    "text": "Travailler avec Java m'a permis de renforcer mes compétences en développement backend. J'ai appris à concevoir des applications robustes et évolutives en utilisant les meilleures pratiques de développement Java et en respectant les normes de qualité élevées.",
                    "icon": "fa-brands fa-java"
                },
                {
                    "id": 4,
                    "title": "Automatisation avec Python",
                    "text": "J'ai développé des compétences en Python pour automatiser des tâches répétitives, améliorant ainsi l'efficacité de notre processus de développement.",
                    "icon": "fa-brands fa-python"
                },
                {
                    "id": 24,
                    "title": "Simulation de réseaux LoRaWAN",
                    "text": "J'ai acquis une expérience pratique dans la simulation de réseaux LoRaWAN pour tester et valider nos solutions IoT avant leur déploiement, garantissant ainsi leur fiabilité et leur performance.",
                    "icon": "fa-solid fa-network-wired"
                },
                {
                    "id": 22,
                    "title": "Machine Virtuelle",
                    "text": "J'ai appris à utiliser des machines virtuelles pour tester et déployer des applications dans des environnements isolés, garantissant ainsi la stabilité et la sécurité de nos solutions logicielles.",
                    "icon": "fa-solid fa-server"
                },
                {
                    "id": 21,
                    "title": "Installation et configuration de postes de travail",
                    "text": "J'ai acquis de l'expérience dans l'installation et la configuration de postes de travail pour les nouveaux employés, en veillant à ce qu'ils disposent des outils et des ressources nécessaires pour réussir dans leur rôle.",
                    "icon": "fa-solid fa-desktop"
                },
                {
                    "id": 18,
                    "title": "Gestion des tickets de correction",
                    "text": "En traitant les tickets de correction, j'ai développé des compétences solides en analyse et en débogage de code. J'ai appris à diagnostiquer rapidement les problèmes, à élaborer des solutions efficaces et à les mettre en œuvre de manière précise pour assurer la stabilité et la fiabilité des applications.",
                    "icon": "fa-solid fa-bug"
                },
                {
                    "id": 11,
                    "title": "Développement de nouvelles fonctionnalités",
                    "text": "La mise en place de nouvelles fonctionnalités m'a offert l'occasion d'innover et de repousser les limites des logiciels existants. J'ai appris à recueillir les exigences des clients, à concevoir des solutions techniques adaptées et à les mettre en œuvre de manière efficace, en veillant à ce qu'elles soient conviviales et répondent aux besoins métier spécifiques.",
                    "icon": "fa-solid fa-lightbulb"
                }
            ],
            "competencesFonctionelle": [
                {
                    "id": 25,
                    "title": "Travail en équipe",
                    "text": "Travailler à plusieur m'a permis de développer mes compétences en travail d'équipe. J'ai appris à collaborer efficacement avec les membres de l'équipe, à partager mes connaissances et à résoudre les problèmes ensemble.",
                    "icon": "fa-solid fa-people-carry-box"
                },
                {
                    "id": 19,
                    "title": "Gestion du temps",
                    "text": "La gestion du temps était un aspect crucial de ce projet. J'ai appris à prioriser les tâches, à respecter les échéances et à m'adapter aux changements pour atteindre nos objectifs dans les délais impartis.",
                    "icon": "fa-solid fa-clock"
                },
                {
                    "id": 1,
                    "title": "Adaptabilité",
                    "text": "Travailler sur ces projets m'a également appris à être adaptable et à m'adapter rapidement aux nouvelles technologies et aux nouveaux défis. J'ai appris à sortir de ma zone de confort et à relever des défis techniques avec confiance.",
                    "icon": "fa-solid fa-briefcase"
                },
                {
                    "id": 5,
                    "title": "Autonomie",
                    "text": "J'ai également développé mes compétences en autonomie en travaillant sur ces projets. J'ai appris à prendre des initiatives, à résoudre les problèmes de manière indépendante et à être proactif dans mon apprentissage.",
                    "icon": "fa-solid fa-user-check"
                },
                {
                    "id": 6,
                    "title": "Curiosité",
                    "text": "Travailler sur des projets variés m'a permis de développer ma curiosité et ma soif d'apprendre. J'ai appris à explorer de nouvelles technologies, à relever de nouveaux défis et à rester constamment à jour sur les dernières tendances du secteur pour améliorer mes compétences et rester compétitif.",
                    "icon": "fa-solid fa-search"
                },
                {
                    "id": 23,
                    "title": "Relation Client",
                    "text": "En travaillant pour les demandes des clients, j'ai développé mes compétences en relation client. J'ai appris à écouter attentivement les besoins des clients, à communiquer efficacement avec eux et à fournir des solutions adaptées pour répondre à leurs attentes.",
                    "icon": "fa-solid fa-headset"
                },
                {
                    "id": 15,
                    "title": "Écoute active",
                    "text": "À travers diverses interactions avec les membres de l'équipe et les clients au cours de réunion, j'ai développé mes compétences en écoute active. J'ai appris à écouter attentivement les besoins et les préoccupations des autres, à poser des questions pertinentes et à fournir des réponses adaptées pour favoriser une communication efficace et une collaboration harmonieuse.",
                    "icon": "fa-solid fa-ear-listen"
                }
            ],
            "conclusion": "Mon expérience chez REQUEA m'a non seulement permis de développer mes compétences techniques dans le domaine du développement logiciel web et de l'IoT, mais m'a également offert une expérience précieuse en gestion de projet, en collaboration d'équipe et en résolution de problèmes. Je suis enthousiaste à l'idée de continuer à contribuer au succès de notre entreprise tout en continuant à développer mes compétences et connaissances dans ce domaine en constante évolution."
        }
    },
    "competence": [
        {
            "id": 1,
            "title": "Adaptabilité",
            "text": "Chaque projet sur lequel j'ai travaillé a présenté un ensemble unique de défis, exigeant une adaptation rapide à de nouvelles technologies, frameworks, et méthodologies. Cette nécessité constante de m'adapter a considérablement renforcé ma flexibilité et ma capacité à apprendre rapidement. Par exemple, lors d'un projet récent, j'ai dû maîtriser un nouveau langage de programmation en peu de temps pour répondre aux exigences spécifiques du client. Cette expérience m'a appris à être proactif dans l'acquisition de nouvelles compétences et à ne pas avoir peur de plonger dans l'inconnu.",
            "icon": "fa-solid fa-briefcase",
            "type": "soft",
            "projets": [
                "lei",
                "requea"
            ]
        },
        {
            "id": 2,
            "title": "Apprentissage de ASP.NET",
            "text": "Bien que je n'aie pas eu d'expérience antérieure avec ASP.NET, j'ai rapidement appris ses concepts fondamentaux et ses meilleures pratiques tout en travaillant sur la migration. Cette expérience, acquise au travers d'un stage chez LEI, m'a permis de comprendre les tenants et les aboutissants du développement backend et de développer mes compétences en C#. En effet, durant ce stage, j'ai été confronté à divers défis techniques qui m'ont poussé à approfondir mes connaissances en ASP.NET et à adopter les meilleures pratiques en matière de développement logiciel. J'ai eu l'occasion de collaborer avec une équipe de développeurs expérimentés, ce qui m'a permis d'apprendre non seulement les aspects techniques, mais aussi les méthodologies de travail en équipe et la gestion de projets. Ce stage m'a également offert l'opportunité de travailler sur des projets concrets, où j'ai pu mettre en pratique mes compétences en C# et contribuer activement à l'amélioration des systèmes existants. Grâce à cette expérience, j'ai pu développer une approche structurée et méthodique du développement backend, tout en renforçant ma capacité à résoudre des problèmes complexes et à innover dans des environnements techniques exigeants.",
            "icon": "fa-solid fa-code",
            "type": "technique",
            "projets": [
                "lei"
            ]
        },
        {
            "id": 3,
            "title": "Architecture RESTful",
            "text": "Lors de mon stage chez LEI, j'ai eu l'opportunité de comprendre en profondeur les principes fondamentaux de l'architecture REST et de les mettre en pratique. Cette expérience m'a permis d'acquérir des compétences précieuses dans la conception d'API REST efficaces et évolutives, facilitant une communication fluide et optimisée entre le frontend et le backend. J'ai travaillé sur plusieurs projets où j'ai pu appliquer ces concepts, notamment en développant des endpoints sécurisés et en optimisant les performances des appels API. De plus, j'ai appris à documenter soigneusement les API, à gérer les versions et à implémenter des mécanismes de gestion des erreurs robustes, assurant ainsi une meilleure maintenabilité et évolutivité des applications.",
            "icon": "fa-solid fa-code",
            "type": "technique",
            "projets": [
                "lei"
            ]
        },
        {
            "id": 4,
            "title": "Automatisation avec Python",
            "text": "Dans le cadre de mon emploi chez Requea, j'ai développé des compétences approfondies en Python pour automatiser diverses tâches répétitives, ce qui a considérablement amélioré l'efficacité de nos processus de développement. J'ai conçu et mis en œuvre des scripts pour extraire et traiter des données provenant de diverses sources, ce qui a simplifié l'analyse des données et la prise de décisions. De plus, j'ai automatisé le déploiement de nos applications, réduisant ainsi les risques d'erreurs humaines et accélérant le processus de mise en production. En travaillant sur ces projets, j'ai non seulement amélioré ma maîtrise de Python, mais j'ai aussi acquis une meilleure compréhension des besoins opérationnels de notre entreprise et des meilleures pratiques en matière de développement logiciel.",
            "icon": "fa-brands fa-python",
            "type": "technique",
            "projets": [
                "requea"
            ],
            "projetsPerso": [
                "requin"
            ]
        },
        {
            "id": 5,
            "title": "Autonomie",
            "text": "J'ai également développé mes compétences en autonomie en travaillant sur divers projets au cours de mes stages et alternances. Ces expériences m'ont permis d'apprendre à prendre des initiatives et à résoudre les problèmes de manière indépendante. En étant confronté à des situations réelles, j'ai dû souvent trouver des solutions par moi-même, ce qui m'a poussé à devenir plus proactif dans mon apprentissage et mon développement professionnel.Ces expériences ont été cruciales pour renforcer ma capacité à travailler de manière autonome. Elles m'ont appris l'importance de l'initiative personnelle et m'ont aidé à développer une mentalité proactive, indispensable pour réussir dans un environnement professionnel dynamique et exigeant.",
            "icon": "fa-solid fa-user-check",
            "type": "soft",
            "projets": [
                "requea",
                "lei",
                "octafood"
            ],
            "projetsPerso": [
                "astar",
                "pokexpert"
            ]
        },
        {
            "id": 6,
            "title": "Curiosité",
            "text": "Travailler sur des projets variés m'a permis de développer ma curiosité et ma soif d'apprendre. Grâce à mes stages et alternances, j'ai été exposé à des environnements diversifiés où chaque projet présentait des défis uniques. Cette diversité m'a poussé à explorer de nouvelles technologies et à relever des défis inconnus, stimulant ainsi ma curiosité naturelle.Ces expériences ont renforcé ma conviction que la curiosité est essentielle pour rester compétitif dans un secteur en constante évolution. En étant constamment à la recherche de nouvelles connaissances et en relevant de nouveaux défis, j'ai pu améliorer mes compétences et apporter une valeur ajoutée significative aux projets sur lesquels j'ai travaillé.",
            "icon": "fa-solid fa-search",
            "type": "soft",
            "projets": [
                "lei",
                "requea",
                "octafood"
            ],
            "projetsPerso": [
                "astar",
                "pokexpert"
            ]
        },
        {
            "id": 7,
            "title": "Angular 5",
            "text": "Lors de mon stage chez LEI, j'ai eu l'opportunité de découvrir Angular, plus précisément Angular 5, dans le cadre d'un projet de migration. Cette expérience a été une véritable révélation pour moi. Sans expérience préalable avec Angular, j'ai plongé dans cet écosystème passionnant et j'ai appris à concevoir des interfaces utilisateur dynamiques et réactives en utilisant les concepts modernes du développement frontend.Le projet de migration vers Angular 5 m'a confronté à de nombreux défis techniques et conceptuels. J'ai dû me familiariser rapidement avec le framework, comprendre sa structure et ses meilleures pratiques, et assimiler des concepts clés tels que les composants, les services, et les modules. Cette immersion intense m'a permis de développer une compréhension approfondie des principes de base d'Angular et de son fonctionnement interne.",
            "icon": "fa-brands fa-angular",
            "type": "technique",
            "projets": [
                "lei"
            ]
        },
        {
            "id": 8,
            "title": "Développement agile",
            "text": "Durant l'ensemble de mes expériences professionnelles, j'ai presque toujours travaillé en utilisant les méthodologies de développement agile avec mes collègues. Ces expériences m'ont permis de m'initier et de me familiariser avec les principes agiles, ce qui a grandement influencé ma façon de gérer les projets et de collaborer en équipe. Grâce à l'approche agile, j'ai appris à travailler de manière itérative, en découpant les projets en sprints courts et en livrant des versions incrémentales du produit. Cela m'a permis de rester flexible et de m'adapter rapidement aux changements de priorités ou aux retours des clients. Par exemple, lors de mon stage chez LEI, nous avons suivi la méthodologie Scrum, ce qui impliquait des réunions quotidiennes, des revues de sprint et des rétrospectives. Ces pratiques m'ont aidé à mieux comprendre les attentes et à ajuster le développement en fonction des besoins évolutifs.",
            "icon": "fa-solid fa-tasks",
            "type": "soft",
            "projets": [
                "lei",
                "requea",
                "octafood"
            ]
        },
        {
            "id": 9,
            "title": "Développement C#.NET",
            "text": "Lors de mon alternance chez Octafood, j'ai eu l'opportunité de travailler sur une application métier en C#.NET, ce qui m'a permis de renforcer considérablement mes compétences en développement backend. Travailler sur ce projet m'a appris à concevoir des applications robustes et évolutives en utilisant les meilleures pratiques de développement en C# et en respectant des normes de qualité élevées. Ce projet m'a permis d'explorer en profondeur l'écosystème .NET et d'acquérir une maîtrise des outils et des frameworks associés. J'ai appris à structurer le code de manière modulaire et maintenable, en utilisant des techniques telles que l'injection de dépendances et le découplage des composants. Par exemple, j'ai implémenté une architecture basée sur les services, ce qui a permis de faciliter la maintenance et l'évolution de l'application.",
            "icon": "fa-solid fa-code",
            "type": "technique",
            "projets": [
                "lei",
                "octafood"
            ]
        },
        {
            "id": 10,
            "title": "Développement Delphi",
            "text": "Travailler avec Delphi chez Octafood a été une expérience enrichissante et unique pour moi. J'ai eu l'opportunité d'apprendre à concevoir des applications Windows robustes et conviviales en exploitant les fonctionnalités avancées de Delphi, tout en répondant aux exigences spécifiques du secteur de l'agroalimentaire. Pendant mon temps chez Octafood, j'ai été impliqué dans le développement d'applications critiques pour les opérations quotidiennes de l'entreprise. Utiliser Delphi m'a permis de bénéficier de sa richesse en fonctionnalités et de sa puissance pour créer des interfaces utilisateur intuitives et efficaces. J'ai appris à exploiter les composants visuels de Delphi pour concevoir des interfaces utilisateur ergonomiques et adaptées aux besoins des utilisateurs finaux.",
            "icon": "fa-solid fa-code",
            "type": "technique",
            "projets": [
                "octafood"
            ]
        },
        {
            "id": 11,
            "title": "Développement de nouvelles fonctionnalités",
            "text": "La mise en place de nouvelles fonctionnalités dans mes projets m'a permis de développer une compétence essentielle : celle d'innover et de repousser les limites des logiciels existants. Ce processus implique plusieurs étapes clés qui ont enrichi mon parcours professionnel. Je me suis exercé à concevoir des solutions techniques adaptées aux exigences recueillies. Cela implique d'évaluer différentes approches possibles, de considérer les contraintes techniques et budgétaires, et de proposer une architecture qui réponde aux critères de performance, de sécurité et d'évolutivité. J'ai appris à utiliser des outils comme les diagrammes UML pour modéliser mes conceptions et à documenter mes choix pour assurer la clarté et la traçabilité du processus.",
            "icon": "fa-solid fa-lightbulb",
            "type": "technique",
            "projets": [
                "lei",
                "requea",
                "octafood"
            ]
        },
        {
            "id": 12,
            "title": "Développement IoT",
            "text": "Travailler dans le domaine de l'IoT m'a permis d'explorer un univers technologique fascinant et en constante évolution. Cette expérience m'a ouvert les portes pour concevoir des solutions IoT innovantes en utilisant des capteurs, des réseaux sans fil et des plateformes cloud. L'objectif était de collecter, analyser et visualiser des données en temps réel afin d'améliorer les processus et les décisions basées sur les données. En travaillant sur des projets IoT, j'ai appris à sélectionner et à intégrer efficacement des capteurs adaptés aux besoins spécifiques de chaque application. Cela inclut la compréhension des types de capteurs disponibles, comme les capteurs de température, d'humidité, de mouvement, et bien d'autres encore, ainsi que leur déploiement optimal pour garantir une collecte de données précise et fiable. J'ai également acquis des compétences essentielles dans la mise en place de réseaux sans fil adaptés à l'IoT, tels que les réseaux LoRaWAN.",
            "icon": "fa-solid fa-network-wired",
            "type": "technique",
            "projets": [
                "lei",
                "requea"
            ]
        },
        {
            "id": 13,
            "title": "Développement Java",
            "text": "Travailler quotidiennement avec Java chez Requea m'a offert une opportunité précieuse de renforcer mes compétences en développement backend. Cette expérience m'a permis d'apprendre à concevoir des applications robustes et évolutives en utilisant les meilleures pratiques de développement Java et en respectant des normes de qualité élevées. En utilisant Java, j'ai été amené à développer des modules et des fonctionnalités pour les clients de Requea, ce qui m'a permis d'explorer divers aspects du développement logiciel. J'ai acquis une compréhension approfondie des fondamentaux de Java, y compris la programmation orientée objet, la gestion de la mémoire, les collections, et les threads. Cette base solide m'a permis de structurer efficacement le code, en utilisant des designs patterns appropriés pour assurer la maintenabilité et la scalabilité des applications développées.",
            "icon": "fa-brands fa-java",
            "type": "technique",
            "projets": [
                "lei",
                "requea"
            ]
        },
        {
            "id": 14,
            "title": "Développement Web",
            "text": "Travailler sur des projets de développement web m'a permis de consolider mes compétences dans la conception d'interfaces utilisateur conviviales et réactives. J'ai acquis une expérience significative en utilisant plusieurs technologies clés, notamment PHP avec le framework Laravel pour mes projets personnels, ainsi que HTML, CSS et beaucoup de JavaScript, que j'ai également utilisé dans le cadre de mon alternance chez Requea pour créer des scripts et des fonctionnalités interactives. En utilisant PHP et Laravel pour mes projets personnels, j'ai appris à développer des applications web robustes et sécurisées tout en suivant des bonnes pratiques de développement. Laravel m'a permis de gérer efficacement les routes, les bases de données et l'authentification, tout en offrant des fonctionnalités avancées telles que la gestion des sessions et la création de APIs RESTful. L'usage fréquent de JavaScript a été une autre composante essentielle de mon expérience. J'ai développé mes compétences dans l'écriture de scripts JavaScript pour améliorer l'interactivité des applications web, en utilisant des bibliothèques comme jQuery et des frameworks modernes comme Vue.js pour construire des interfaces utilisateur dynamiques et réactives.",
            "icon": "fa-solid fa-code",
            "type": "technique",
            "projets": [
                "lei",
                "requea"
            ],
            "projetsPerso": [
                "astar",
                "pokexpert"
            ]
        },
        {
            "id": 15,
            "title": "Écoute active",
            "text": "À travers diverses interactions avec les membres de l'équipe et les clients au cours de réunion, j'ai développé mes compétences en écoute active. J'ai appris à écouter attentivement les besoins et les préoccupations des autres, à poser des questions pertinentes et à fournir des réponses adaptées pour favoriser une communication efficace et une collaboration harmonieuse.",
            "icon": "fa-solid fa-ear-listen",
            "type": "soft",
            "projets": [
                "lei",
                "requea",
                "octafood"
            ]
        },
        {
            "id": 16,
            "title": "Gestion de base de données",
            "text": "Pour gérer les données collectées dans mes différents projets professionnels et personnels, j'ai développé des compétences avancées en gestion de bases de données. Cette expérience m'a permis d'apprendre à concevoir des schémas de base de données efficaces, à optimiser les requêtes SQL et à assurer la sécurité des données, garantissant ainsi la fiabilité et la performance des applications. Au cours de mon travail quotidien, j'utilise régulièrement des bases de données pour stocker et manipuler des données critiques. J'ai acquis une compréhension approfondie des différents types de bases de données relationnelles et non relationnelles, ainsi que de leurs cas d'utilisation appropriés. J'ai travaillé avec des systèmes de gestion de bases de données (SGBD) tels que MySQL, PostgreSQL et MongoDB, en adaptant mes choix en fonction des besoins spécifiques de chaque projet. Dans la conception de schémas de base de données, j'ai appris à structurer les données de manière logique et efficace, en tenant compte des relations entre les entités et en optimisant la performance des requêtes. Cela inclut la normalisation des données pour éviter la redondance et assurer l'intégrité référentielle, ainsi que la dénormalisation lorsque nécessaire pour optimiser les performances de lecture",
            "icon": "fa-solid fa-database",
            "type": "technique",
            "projets": [
                "lei",
                "requea"
            ],
            "projetsPerso": [
                "astar",
                "pokexpert"
            ]
        },
        {
            "id": 17,
            "title": "Gestion de projet",
            "text": "Travailler sur ces projets m'a également permis d'acquérir une expérience précieuse en gestion de projet. Que ce soit sur des projets personnels que j'ai initiés de zéro ou dans un environnement professionnel où les projets étaient déjà en cours de développement, j'ai développé des compétences essentielles en gestion du temps, en priorisation des tâches et en collaboration efficace avec les membres de l'équipe pour atteindre nos objectifs communs. Dans mes projets personnels, démarrer de zéro m'a enseigné l'importance de la planification initiale et de l'établissement d'objectifs clairs. J'ai appris à décomposer les grands objectifs en étapes plus petites et gérables, à évaluer les ressources nécessaires et à définir des échéances réalistes. Cela m'a aidé à maintenir la motivation et à rester concentré sur l'achèvement des étapes successives du projet. Au travail, où les projets étaient déjà en cours de développement, j'ai été confronté à des défis différents mais tout aussi enrichissants. J'ai appris à intégrer efficacement mes contributions dans le cadre existant, à comprendre les priorités établies et à ajuster mes activités en fonction des besoins de l'équipe et des délais fixés. Cela inclut souvent la capacité à travailler dans un environnement agile, à participer activement aux réunions de planification et de revue, et à adapter mes tâches en fonction des changements et des feedbacks reçus.",
            "icon": "fa-solid fa-people-group",
            "type": "soft",
            "projets": [
                "lei",
                "requea",
                "octafood"
            ],
            "projetsPerso": [
                "astar"
            ]
        },
        {
            "id": 18,
            "title": "Gestion des tickets de correction",
            "text": "Pendant mon alternance chez Octafood, j'ai régulièrement été chargé de résoudre des tickets de correction, ce qui m'a permis de développer des compétences solides en analyse et en débogage de code. Cette expérience a été essentielle pour améliorer ma capacité à diagnostiquer rapidement les problèmes, à élaborer des solutions efficaces et à les mettre en œuvre avec précision afin d'assurer la stabilité et la fiabilité des applications. Chaque ticket de correction représentait un défi unique, allant de bugs critiques à des améliorations de performances ou à des ajustements fonctionnels. Pour chaque problème identifié, j'ai d'abord utilisé mes compétences d'analyse pour comprendre en profondeur le comportement indésirable ou l'erreur signalée. Cela impliquait souvent d'analyser les journaux d'erreurs, de reproduire le problème dans un environnement de test et d'interagir avec les utilisateurs pour obtenir des détails supplémentaires si nécessaire.",
            "icon": "fa-solid fa-bug",
            "type": "technique",
            "projets": [
                "lei",
                "requea",
                "octafood"
            ]
        },
        {
            "id": 19,
            "title": "Gestion du temps",
            "text": "La gestion du temps était un aspect crucial de mes projets. J'ai appris à prioriser les tâches, à respecter les échéances et à m'adapter aux changements pour atteindre mes objectifs dans les délais impartis.",
            "icon": "fa-solid fa-clock",
            "type": "soft",
            "projets": [
                "lei",
                "requea",
                "octafood"
            ]
        },
        {
            "id": 20,
            "title": "Installation chez les clients",
            "text": "Au cours de mon alternance chez Octafood, j'ai été régulièrement chargé d'installer notre logiciel ainsi que des outils chez nos clients. Cette responsabilité m'a permis de réaliser l'importance cruciale de l'interopérabilité et de la compatibilité logicielle. J'ai acquis une expérience pratique précieuse dans la configuration et le déploiement de solutions logicielles sur une variété d'infrastructures, en m'assurant que les installations se déroulent sans heurts et que les clients soient entièrement satisfaits de nos services. Chaque installation chez un client représentait un défi unique, nécessitant une compréhension approfondie des besoins spécifiques de l'entreprise cliente ainsi que des contraintes technologiques et environnementales. Avant chaque déploiement, j'ai collaboré étroitement avec les équipes de développement et de support pour préparer soigneusement l'environnement cible, en m'assurant que tous les prérequis matériels et logiciels étaient respectés.",
            "icon": "fa-solid fa-server",
            "type": "technique",
            "projets": [
                "octafood"
            ]
        },
        {
            "id": 21,
            "title": "Installation et configuration de postes de travail",
            "text": "J'ai acquis de l'expérience dans l'installation et la configuration de postes de travail pour les nouveaux employés, en veillant à ce qu'ils disposent des outils et des ressources nécessaires pour réussir dans leur rôle.",
            "icon": "fa-solid fa-desktop",
            "type": "technique",
            "projets": [
                "lei",
                "requea"
            ]
        },
        {
            "id": 22,
            "title": "Machine Virtuelle",
            "text": "Dans le cadre de mon alternance chez Requea, j'ai acquis une expérience significative dans l'utilisation de machines virtuelles pour tester et déployer des applications, notamment pour intégrer une armoire à clé connectée à notre logiciel. Les machines virtuelles ont été cruciales pour créer des environnements de test isolés et contrôlés. Elles m'ont permis de simuler diverses configurations réseau et matérielles sans perturber les systèmes de production réels. Cela était particulièrement important pour garantir la stabilité et la sécurité de notre solution logicielle avant le déploiement chez les clients. J'ai utilisé ces environnements virtuels pour valider l'intégration de l'armoire à clé avec notre plateforme logicielle, tester les fonctionnalités telles que l'accès sécurisé et le reporting des données, et simuler différents scénarios d'utilisation pour identifier et résoudre les problèmes potentiels à un stade précoce.",
            "icon": "fa-solid fa-server",
            "type": "technique",
            "projets": [
                "lei",
                "requea"
            ]
        },
        {
            "id": 23,
            "title": "Relation Client",
            "text": "En travaillant pour les demandes des clients, j'ai développé mes compétences en relation client. J'ai appris à écouter attentivement les besoins des clients, à communiquer efficacement avec eux et à fournir des solutions adaptées pour répondre à leurs attentes.",
            "icon": "fa-solid fa-headset",
            "type": "soft",
            "projets": [
                "lei",
                "requea",
                "octafood"
            ]
        },
        {
            "id": 24,
            "title": "Simulation de réseaux LoRaWAN",
            "text": "J'ai acquis une expérience pratique dans la simulation de réseaux LoRaWAN pour tester et valider nos solutions IoT avant leur déploiement, garantissant ainsi leur fiabilité et leur performance.",
            "icon": "fa-solid fa-network-wired",
            "type": "technique",
            "projets": [
                "lei",
                "requea"
            ]
        },
        {
            "id": 25,
            "title": "Travail en équipe",
            "text": "Travailler à plusieurs m'a permis de développer mes compétences en travail d'équipe. J'ai appris à collaborer efficacement avec les membres de l'équipe, à partager mes connaissances et à résoudre les problèmes ensemble.",
            "icon": "fa-solid fa-people-carry-box",
            "type": "soft",
            "projets": [
                "lei",
                "requea",
                "octafood"
            ]
        }
    ]
}